MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18857/mcu.h
// Register: IOCAF
#define IOCAF IOCAF
extern volatile unsigned char           IOCAF               __at(0x1F3F);
#ifndef _LIB_BUILD
asm("IOCAF equ 01F3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCAF0                 :1;
        unsigned IOCAF1                 :1;
        unsigned IOCAF2                 :1;
        unsigned IOCAF3                 :1;
        unsigned IOCAF4                 :1;
        unsigned IOCAF5                 :1;
        unsigned IOCAF6                 :1;
        unsigned IOCAF7                 :1;
    };
} IOCAFbits_t;
extern volatile IOCAFbits_t IOCAFbits __at(0x1F3F);
// bitfield macros
#define _IOCAF_IOCAF0_POSN                                  0x0
#define _IOCAF_IOCAF0_POSITION                              0x0
#define _IOCAF_IOCAF0_SIZE                                  0x1
#define _IOCAF_IOCAF0_LENGTH                                0x1
#define _IOCAF_IOCAF0_MASK                                  0x1
#define _IOCAF_IOCAF1_POSN                                  0x1
#define _IOCAF_IOCAF1_POSITION                              0x1
#define _IOCAF_IOCAF1_SIZE                                  0x1
#define _IOCAF_IOCAF1_LENGTH                                0x1
#define _IOCAF_IOCAF1_MASK                                  0x2
#define _IOCAF_IOCAF2_POSN                                  0x2
#define _IOCAF_IOCAF2_POSITION                              0x2
#define _IOCAF_IOCAF2_SIZE                                  0x1
#define _IOCAF_IOCAF2_LENGTH                                0x1
#define _IOCAF_IOCAF2_MASK                                  0x4
#define _IOCAF_IOCAF3_POSN                                  0x3
#define _IOCAF_IOCAF3_POSITION                              0x3
#define _IOCAF_IOCAF3_SIZE                                  0x1
#define _IOCAF_IOCAF3_LENGTH                                0x1
#define _IOCAF_IOCAF3_MASK                                  0x8
#define _IOCAF_IOCAF4_POSN                                  0x4
#define _IOCAF_IOCAF4_POSITION                              0x4
#define _IOCAF_IOCAF4_SIZE                                  0x1
#define _IOCAF_IOCAF4_LENGTH                                0x1
#define _IOCAF_IOCAF4_MASK                                  0x10
#define _IOCAF_IOCAF5_POSN                                  0x5
#define _IOCAF_IOCAF5_POSITION                              0x5
#define _IOCAF_IOCAF5_SIZE                                  0x1
#define _IOCAF_IOCAF5_LENGTH                                0x1
#define _IOCAF_IOCAF5_MASK                                  0x20
#define _IOCAF_IOCAF6_POSN                                  0x6
#define _IOCAF_IOCAF6_POSITION                              0x6
#define _IOCAF_IOCAF6_SIZE                                  0x1
#define _IOCAF_IOCAF6_LENGTH                                0x1
#define _IOCAF_IOCAF6_MASK                                  0x40
#define _IOCAF_IOCAF7_POSN                                  0x7
#define _IOCAF_IOCAF7_POSITION                              0x7
#define _IOCAF_IOCAF7_SIZE                                  0x1
#define _IOCAF_IOCAF7_LENGTH                                0x1
#define _IOCAF_IOCAF7_MASK                                  0x80

// Register: CCDNA
#define CCDNA CCDNA
extern volatile unsigned char           CCDNA               __at(0x1F40);
#ifndef _LIB_BUILD
asm("CCDNA equ 01F40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNA0                 :1;
        unsigned CCDNA1                 :1;
        unsigned CCDNA2                 :1;
        unsigned CCDNA3                 :1;
        unsigned CCDNA4                 :1;
        unsigned CCDNA5                 :1;
        unsigned CCDNA6                 :1;
        unsigned CCDNA7                 :1;
    };
} CCDNAbits_t;
extern volatile CCDNAbits_t CCDNAbits __at(0x1F40);
// bitfield macros
#define _CCDNA_CCDNA0_POSN                                  0x0
#define _CCDNA_CCDNA0_POSITION                              0x0
#define _CCDNA_CCDNA0_SIZE                                  0x1
#define _CCDNA_CCDNA0_LENGTH                                0x1
#define _CCDNA_CCDNA0_MASK                                  0x1
#define _CCDNA_CCDNA1_POSN                                  0x1
#define _CCDNA_CCDNA1_POSITION                              0x1
#define _CCDNA_CCDNA1_SIZE                                  0x1
#define _CCDNA_CCDNA1_LENGTH                                0x1
#define _CCDNA_CCDNA1_MASK                                  0x2
#define _CCDNA_CCDNA2_POSN                                  0x2
#define _CCDNA_CCDNA2_POSITION                              0x2
#define _CCDNA_CCDNA2_SIZE                                  0x1
#define _CCDNA_CCDNA2_LENGTH                                0x1
#define _CCDNA_CCDNA2_MASK                                  0x4
#define _CCDNA_CCDNA3_POSN                                  0x3
#define _CCDNA_CCDNA3_POSITION                              0x3
#define _CCDNA_CCDNA3_SIZE                                  0x1
#define _CCDNA_CCDNA3_LENGTH                                0x1
#define _CCDNA_CCDNA3_MASK                                  0x8
#define _CCDNA_CCDNA4_POSN                                  0x4
#define _CCDNA_CCDNA4_POSITION                              0x4
#define _CCDNA_CCDNA4_SIZE                                  0x1
#define _CCDNA_CCDNA4_LENGTH                                0x1
#define _CCDNA_CCDNA4_MASK                                  0x10
#define _CCDNA_CCDNA5_POSN                                  0x5
#define _CCDNA_CCDNA5_POSITION                              0x5
#define _CCDNA_CCDNA5_SIZE                                  0x1
#define _CCDNA_CCDNA5_LENGTH                                0x1
#define _CCDNA_CCDNA5_MASK                                  0x20
#define _CCDNA_CCDNA6_POSN                                  0x6
#define _CCDNA_CCDNA6_POSITION                              0x6
#define _CCDNA_CCDNA6_SIZE                                  0x1
#define _CCDNA_CCDNA6_LENGTH                                0x1
#define _CCDNA_CCDNA6_MASK                                  0x40
#define _CCDNA_CCDNA7_POSN                                  0x7
#define _CCDNA_CCDNA7_POSITION                              0x7
#define _CCDNA_CCDNA7_SIZE                                  0x1
#define _CCDNA_CCDNA7_LENGTH                                0x1
#define _CCDNA_CCDNA7_MASK                                  0x80

// Register: CCDPA
#define CCDPA CCDPA
extern volatile unsigned char           CCDPA               __at(0x1F41);
#ifndef _LIB_BUILD
asm("CCDPA equ 01F41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPA0                 :1;
        unsigned CCDPA1                 :1;
        unsigned CCDPA2                 :1;
        unsigned CCDPA3                 :1;
        unsigned CCDPA4                 :1;
        unsigned CCDPA5                 :1;
        unsigned CCDPA6                 :1;
        unsigned CCDPA7                 :1;
    };
} CCDPAbits_t;
